import type { CatchMindCategory } from "./categories";

export const MOVIE_CATEGORIES = [
    {
  key: "movies",
  label: "영화",
  difficulty: "hard",
  words: [
    // 한국
    "기생충", "극한직업", "부산행", "명량", "암살", "택시운전사",
    "범죄도시", "올드보이", "괴물", "신과함께", "도둑들", "베테랑",
    "국제시장", "7번방의선물", "친구", "신세계", "살인의추억", "태극기휘날리며",
    "곡성", "밀정", "서울의봄", "파묘", "실미도", "타짜","왕과사는남자",

    // 해외
    "타이타닉", "아바타", "인터스텔라", "인셉션", "매트릭스", "터미네이터",
    "죠스", "쥬라기공원", "킹콩", "고질라", "포레스트검프", "캐스트어웨이",
    "글래디에이터", "미션임파서블", "캐리비안의해적", "분노의질주", "트랜스포머", "혹성탈출",
    "ET", "백투더퓨처", "인디아나존스", "2012", "마션", "그래비티",

    // 히어로
    "어벤져스", "아이언맨", "스파이더맨", "배트맨", "슈퍼맨", "닥터스트레인지",
    "블랙팬서", "토르", "캡틴마블", "가디언즈오브갤럭시", "엑스맨", "데드풀",

    // 애니메이션
    "겨울왕국", "토이스토리", "니모를찾아서", "인사이드아웃", "업", "코코",
    "몬스터주식회사", "라따뚜이", "카", "주토피아", "모아나", "라이온킹",
    "알라딘", "미녀와야수", "인어공주", "라푼젤", "뮬란", "헤라클레스",

    // 일본 애니메이션
    "센과치히로의행방불명", "이웃집토토로", "하울의움직이는성", "벼랑위의포뇨", "마녀배달부키키", "원령공주",
    "천공의성라퓨타", "바람계곡의나우시카", "너의이름은", "날씨의아이", "스즈메의문단속", "귀를기울이면",

    // 한국
    "엑시트", "공조", "변호인", "관상", "한산",
    "노량", "해운대", "말아톤", "써니", "스물", "추격자",
    "아저씨", "마더", "감시자들", "도가니", "건축학개론", "과속스캔들",

    // 액션
    "존윅", "탑건", "탑건매버릭", "록키", "람보", "다이하드",
    "킹스맨", "스피드", "007", "본아이덴티티", "본슈프리머시", "본얼티메이텀",

    // SF
    "스타워즈", "듄", "에이리언", "프레데터", "아마겟돈", "퍼시픽림",
    "레디플레이어원", "혹성탈출", "트론", "그래비티", "컨택트",

    // 판타지
    "판의미로", "황금나침반", "판타스틱비스트", "웡카", "찰리와초콜릿공장", "나니아연대기",

    // 공포
    "컨저링", "애나벨", "링", "주온", "샤이닝", "엑소시스트",
    "사탄의인형", "그것", "겟아웃", "콰이어트플레이스", "미드소마", "파라노말액티비티",

    // 명작
    "쇼생크탈출", "그린마일", "레옹", "라이프오브파이", "캐치미이프유캔", "노팅힐",
    "사랑과영혼", "미이라", "라라랜드", "보헤미안랩소디", "위대한쇼맨", "슬럼독밀리어네어",

  // 디즈니
  "엘리멘탈", "소울", "루카", "빅히어로", "주먹왕랄프",
  "엔칸토", "메리다와마법의숲", "볼트", "덤보", "밤비", "판타지아",

  // 픽사
  "인크레더블", "버그라이프", "굿다이노", "온워드", "메이의새빨간비밀",

  // 드림웍스
  "슈렉",  "쿵푸팬더", "드래곤길들이기",
   "마다가스카", "보스베이비", "크루즈패밀리", "장화신은고양이",

  // 일본 애니메이션
  "스즈메의문단속", "시간을달리는소녀", "늑대아이", "너와파도를탈수있다면", "붉은돼지", "추억은방울방울",

  // 시리즈
  "007", "분노의질주",

  // 명작
  "시네마천국", "로마의휴일", "사운드오브뮤직", "죠커", "위플래쉬", "터미널",
  "아폴로13", "트루먼쇼", "식스센스", "브레이브하트", "노인을위한나라는없다"

  ],
},

] as const satisfies readonly CatchMindCategory[];